fengjieliang/STM32F407ZGT6_StdLib/User_Modul/Hardware/inc/bsp_spi_flash.h
#ifndef BSP_SPI_FLASH_H
#define BSP_SPI_FLASH_H

#include "stm32f4xx.h"
#include "bsp_uart.h"
#include "bsp_uart.h"

#define SPI1_CS_Pin GPIO_Pin_0
#define SPI1_CS_GPIO_Port GPIOC

#define FLASH_SPI_CS_LOW()								GPIO_ResetBits(SPI1_CS_GPIO_Port,SPI1_CS_Pin)
#define FLASH_SPI_CS_HIGH()								GPIO_SetBits(SPI1_CS_GPIO_Port,SPI1_CS_Pin)

#define W25X128_Enable()  	FLASH_SPI_CS_LOW()
#define W25X128_Disable()  FLASH_SPI_CS_HIGH()

#define DUMMY  0xFF

/** 
  * @brief  W25Q128FV Commands  
  */  
/* Reset Operations */
#define RESET_ENABLE_CMD                     0x66
#define RESET_MEMORY_CMD                     0x99

#define ENTER_QPI_MODE_CMD                   0x38
#define EXIT_QPI_MODE_CMD                    0xFF

/* Identification Operations */
#define READ_ID_CMD                          0x90
#define DUAL_READ_ID_CMD                     0x92
#define QUAD_READ_ID_CMD                     0x94
#define READ_JEDEC_ID_CMD                    0x9F

/* Read Operations */
#define READ_CMD                             0x03
#define FAST_READ_CMD                        0x0B
#define DUAL_OUT_FAST_READ_CMD               0x3B
#define DUAL_INOUT_FAST_READ_CMD             0xBB
#define QUAD_OUT_FAST_READ_CMD               0x6B
#define QUAD_INOUT_FAST_READ_CMD             0xEB

/* Write Operations */
#define WRITE_ENABLE_CMD                     0x06
#define WRITE_DISABLE_CMD                    0x04

/* Register Operations */
#define READ_STATUS_REG1_CMD                  0x05
#define READ_STATUS_REG2_CMD                  0x35
#define READ_STATUS_REG3_CMD                  0x15

#define WRITE_STATUS_REG1_CMD                 0x01
#define WRITE_STATUS_REG2_CMD                 0x31
#define WRITE_STATUS_REG3_CMD                 0x11


/* Program Operations */
#define PAGE_PROG_CMD                        0x02
#define QUAD_INPUT_PAGE_PROG_CMD             0x32


/* Erase Operations */
#define SECTOR_ERASE_CMD                     0x20
#define BLOCK_ERASE_CMD											 0xD8
#define CHIP_ERASE_CMD                       0xC7

#define PROG_ERASE_RESUME_CMD                0x7A
#define PROG_ERASE_SUSPEND_CMD               0x75



/* Flag Status Register */
#define W25Q128FV_FSR_BUSY                    ((uint8_t)0x01)    /*!< busy */
#define W25Q128FV_FSR_WREN                    ((uint8_t)0x02)    /*!< write enable */
#define W25Q128FV_FSR_QE                      ((uint8_t)0x02)    /*!< quad enable */



#define W25Qx_OK            ((uint8_t)0x00)
#define W25Qx_ERROR         ((uint8_t)0x01)
#define W25Qx_BUSY          ((uint8_t)0x02)
#define W25Qx_TIMEOUT				((uint8_t)0x03)

#define W25Q128FV_FLASH_SIZE                  0x1000000 /* 128 MBits => 16MBytes */
#define W25Q128FV_SECTOR_SIZE                 0x10000   /* 256 sectors of 64KBytes */
#define W25Q128FV_SUBSECTOR_SIZE              0x1000    /* 4096 subsectors of 4kBytes */
#define W25Q128FV_PAGE_SIZE                   0x100     /* 65536 pages of 256 bytes */

#define W25Qx_TIMEOUT_VALUE 1000



void BSP_SPI_FLASH_Init(void);
uint8_t SPI_FLASH_ByteWrite(uint8_t data);
uint8_t SPI_FLASH_Read_ID(void);

static uint8_t BSP_W25Qx_GetStatus(void);
void W25X128_WaitForWriteEnd(void);




void W25X128_ChipErase(void);
void W25X128_SectorErase(uint32_t flashAddr);
void W25X128_BlockErase(uint8_t BlockNum);


void W25X128_BufferRead(uint8_t *pData, uint16_t length, uint32_t read_addr);
void W25X128_PageWrite(uint8_t *pData, uint16_t length, uint32_t page_addr);
void W25X128_BufferWrite(uint8_t *pData, uint16_t data_length, uint32_t write_addr);
#endif
